//-слэш - разрез /слэш в гору \слэш с горы
//Маркеры памяти
//void - пустота - космос - ничего - не использует память
//int  - интеджер - целое - память для чисел 12345
//char - символы - буквы
//long - для всего
//------setup - Название
//------() - круглые скобки (SHIFT+9, SHIFT+0) настройки
//------{} - фигурные скобки (SHIFT+Х, SHIFT+Ъ) Начало и конец
//Сложных приказов
// способности
// змея
// вперет
void zVper(){

}
// направо
void zNaprav(){}
//  налево
void ZNalev(){}
// назад
void ZNaz(){}
// проверить кнопку
void ProvKnop(){}
// зажечь пиксель
void ZaPiks(){}
// нарисовать змейку
void NarZ(){}
// яблоко появиться 
void frukt_spawn(){}


void setup() {  
  
}

void loop() {
  
}
